Autodesk.Revit.DB.WallType
Represents a specific type of wall, such as 'Generic - 8"'.
Remarks:
All wall type objects available in the project can be retrieved from the Document object
via the WallTypes property. Every Wall object has a WallType property that returns the a
WallType object representing the type. This same WallType property can also be used to
change the type of the wall by setting it to a different type.